wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/include/S32K3_DSPI_MSC_WRAPPER.h
#define DSPI_PUSHR_PP_MCSC_SHIFT             DSPI_MSC_PUSHR_PP_SHIFT
#define DSPI_PUSHR_PP_MCSC_WIDTH             DSPI_MSC_PUSHR_PP_WIDTH
#define DSPI_PUSHR_PP_MCSC(x)                DSPI_MSC_PUSHR_PP(x)
#define DSPI_PUSHR_PE_MASK                   DSPI_MSC_PUSHR_PE_MASK
#define DSPI_PUSHR_PE_SHIFT                  DSPI_MSC_PUSHR_PE_SHIFT
#define DSPI_PUSHR_PE_WIDTH                  DSPI_MSC_PUSHR_PE_WIDTH
#define DSPI_PUSHR_PE(x)                     DSPI_MSC_PUSHR_PE(x)
#define DSPI_PUSHR_CTCNT_MASK                DSPI_MSC_PUSHR_CTCNT_MASK
#define DSPI_PUSHR_CTCNT_SHIFT               DSPI_MSC_PUSHR_CTCNT_SHIFT
#define DSPI_PUSHR_CTCNT_WIDTH               DSPI_MSC_PUSHR_CTCNT_WIDTH
#define DSPI_PUSHR_CTCNT(x)                  DSPI_MSC_PUSHR_CTCNT(x)
#define DSPI_PUSHR_EOQ_MASK                  DSPI_MSC_PUSHR_EOQ_MASK
#define DSPI_PUSHR_EOQ_SHIFT                 DSPI_MSC_PUSHR_EOQ_SHIFT
#define DSPI_PUSHR_EOQ_WIDTH                 DSPI_MSC_PUSHR_EOQ_WIDTH
#define DSPI_PUSHR_EOQ(x)                    DSPI_MSC_PUSHR_EOQ(x)
#define DSPI_PUSHR_CTAS_MASK                 DSPI_MSC_PUSHR_CTAS_MASK
#define DSPI_PUSHR_CTAS_SHIFT                DSPI_MSC_PUSHR_CTAS_SHIFT
#define DSPI_PUSHR_CTAS_WIDTH                DSPI_MSC_PUSHR_CTAS_WIDTH
#define DSPI_PUSHR_CTAS(x)                   DSPI_MSC_PUSHR_CTAS(x)
#define DSPI_PUSHR_CONT_MASK                 DSPI_MSC_PUSHR_CONT_MASK
#define DSPI_PUSHR_CONT_SHIFT                DSPI_MSC_PUSHR_CONT_SHIFT
#define DSPI_PUSHR_CONT_WIDTH                DSPI_MSC_PUSHR_CONT_WIDTH
#define DSPI_PUSHR_CONT(x)                   DSPI_MSC_PUSHR_CONT(x)
#define DSPI_POPR_RXDATA_MASK                DSPI_MSC_POPR_RXDATA_MASK
#define DSPI_POPR_RXDATA_SHIFT               DSPI_MSC_POPR_RXDATA_SHIFT
#define DSPI_POPR_RXDATA_WIDTH               DSPI_MSC_POPR_RXDATA_WIDTH
#define DSPI_POPR_RXDATA(x)                  DSPI_MSC_POPR_RXDATA(x)
#define DSPI_TXFR_TXDATA_MASK                DSPI_MSC_TXFR_TXDATA_MASK
#define DSPI_TXFR_TXDATA_SHIFT               DSPI_MSC_TXFR_TXDATA_SHIFT
#define DSPI_TXFR_TXDATA_WIDTH               DSPI_MSC_TXFR_TXDATA_WIDTH
#define DSPI_TXFR_TXDATA(x)                  DSPI_MSC_TXFR_TXDATA(x)
#define DSPI_TXFR_TXCMD_TXDATA_MASK          DSPI_MSC_TXFR_TXCMD_TXDATA_MASK
#define DSPI_TXFR_TXCMD_TXDATA_SHIFT         DSPI_MSC_TXFR_TXCMD_TXDATA_SHIFT
#define DSPI_TXFR_TXCMD_TXDATA_WIDTH         DSPI_MSC_TXFR_TXCMD_TXDATA_WIDTH
#define DSPI_TXFR_TXCMD_TXDATA(x)            DSPI_MSC_TXFR_TXCMD_TXDATA(x)
#define DSPI_RXFR_RXDATA_MASK                DSPI_MSC_RXFR_RXDATA_MASK
#define DSPI_RXFR_RXDATA_SHIFT               DSPI_MSC_RXFR_RXDATA_SHIFT
#define DSPI_RXFR_RXDATA_WIDTH               DSPI_MSC_RXFR_RXDATA_WIDTH
#define DSPI_RXFR_RXDATA(x)                  DSPI_MSC_RXFR_RXDATA(x)
#define DSPI_DSICR0_DPCSx_MASK               DSPI_MSC_DSICR0_DPCSx_MASK
#define DSPI_DSICR0_DPCSx_SHIFT              DSPI_MSC_DSICR0_DPCSx_SHIFT
#define DSPI_DSICR0_DPCSx_WIDTH              DSPI_MSC_DSICR0_DPCSx_WIDTH
#define DSPI_DSICR0_DPCSx(x)                 DSPI_MSC_DSICR0_DPCSx(x)
#define DSPI_DSICR0_PP_MASK                  DSPI_MSC_DSICR0_PP_MASK
#define DSPI_DSICR0_PP_SHIFT                 DSPI_MSC_DSICR0_PP_SHIFT
#define DSPI_DSICR0_PP_WIDTH                 DSPI_MSC_DSICR0_PP_WIDTH
#define DSPI_DSICR0_PP(x)                    DSPI_MSC_DSICR0_PP(x)
#define DSPI_DSICR0_PE_MASK                  DSPI_MSC_DSICR0_PE_MASK
#define DSPI_DSICR0_PE_SHIFT                 DSPI_MSC_DSICR0_PE_SHIFT
#define DSPI_DSICR0_PE_WIDTH                 DSPI_MSC_DSICR0_PE_WIDTH
#define DSPI_DSICR0_PE(x)                    DSPI_MSC_DSICR0_PE(x)
#define DSPI_DSICR0_PES_MASK                 DSPI_MSC_DSICR0_PES_MASK
#define DSPI_DSICR0_PES_SHIFT                DSPI_MSC_DSICR0_PES_SHIFT
#define DSPI_DSICR0_PES_WIDTH                DSPI_MSC_DSICR0_PES_WIDTH
#define DSPI_DSICR0_PES(x)                   DSPI_MSC_DSICR0_PES(x)
#define DSPI_DSICR0_DMS_MASK                 DSPI_MSC_DSICR0_DMS_MASK
#define DSPI_DSICR0_DMS_SHIFT                DSPI_MSC_DSICR0_DMS_SHIFT
#define DSPI_DSICR0_DMS_WIDTH                DSPI_MSC_DSICR0_DMS_WIDTH
#define DSPI_DSICR0_DMS(x)                   DSPI_MSC_DSICR0_DMS(x)
#define DSPI_DSICR0_DSICTAS_MASK             DSPI_MSC_DSICR0_DSICTAS_MASK
#define DSPI_DSICR0_DSICTAS_SHIFT            DSPI_MSC_DSICR0_DSICTAS_SHIFT
#define DSPI_DSICR0_DSICTAS_WIDTH            DSPI_MSC_DSICR0_DSICTAS_WIDTH
#define DSPI_DSICR0_DSICTAS(x)               DSPI_MSC_DSICR0_DSICTAS(x)
#define DSPI_DSICR0_DCONT_MASK               DSPI_MSC_DSICR0_DCONT_MASK
#define DSPI_DSICR0_DCONT_SHIFT              DSPI_MSC_DSICR0_DCONT_SHIFT
#define DSPI_DSICR0_DCONT_WIDTH              DSPI_MSC_DSICR0_DCONT_WIDTH
#define DSPI_DSICR0_DCONT(x)                 DSPI_MSC_DSICR0_DCONT(x)
#define DSPI_DSICR0_CID_MASK                 DSPI_MSC_DSICR0_CID_MASK
#define DSPI_DSICR0_CID_SHIFT                DSPI_MSC_DSICR0_CID_SHIFT
#define DSPI_DSICR0_CID_WIDTH                DSPI_MSC_DSICR0_CID_WIDTH
#define DSPI_DSICR0_CID(x)                   DSPI_MSC_DSICR0_CID(x)
#define DSPI_DSICR0_TRRE_MASK                DSPI_MSC_DSICR0_TRRE_MASK
#define DSPI_DSICR0_TRRE_SHIFT               DSPI_MSC_DSICR0_TRRE_SHIFT
#define DSPI_DSICR0_TRRE_WIDTH               DSPI_MSC_DSICR0_TRRE_WIDTH
#define DSPI_DSICR0_TRRE(x)                  DSPI_MSC_DSICR0_TRRE(x)
#define DSPI_DSICR0_TPOL_MASK                DSPI_MSC_DSICR0_TPOL_MASK
#define DSPI_DSICR0_TPOL_SHIFT               DSPI_MSC_DSICR0_TPOL_SHIFT
#define DSPI_DSICR0_TPOL_WIDTH               DSPI_MSC_DSICR0_TPOL_WIDTH
#define DSPI_DSICR0_TPOL(x)                  DSPI_MSC_DSICR0_TPOL(x)
#define DSPI_DSICR0_TXSS_MASK                DSPI_MSC_DSICR0_TXSS_MASK
#define DSPI_DSICR0_TXSS_SHIFT               DSPI_MSC_DSICR0_TXSS_SHIFT
#define DSPI_DSICR0_TXSS_WIDTH               DSPI_MSC_DSICR0_TXSS_WIDTH
#define DSPI_DSICR0_TXSS(x)                  DSPI_MSC_DSICR0_TXSS(x)
#define DSPI_DSICR0_TSBC_MASK                DSPI_MSC_DSICR0_TSBC_MASK
#define DSPI_DSICR0_TSBC_SHIFT               DSPI_MSC_DSICR0_TSBC_SHIFT
#define DSPI_DSICR0_TSBC_WIDTH               DSPI_MSC_DSICR0_TSBC_WIDTH
#define DSPI_DSICR0_TSBC(x)                  DSPI_MSC_DSICR0_TSBC(x)
#define DSPI_DSICR0_ITSB_MASK                DSPI_MSC_DSICR0_ITSB_MASK
#define DSPI_DSICR0_ITSB_SHIFT               DSPI_MSC_DSICR0_ITSB_SHIFT
#define DSPI_DSICR0_ITSB_WIDTH               DSPI_MSC_DSICR0_ITSB_WIDTH
#define DSPI_DSICR0_ITSB(x)                  DSPI_MSC_DSICR0_ITSB(x)
#define DSPI_DSICR0_TRG_MASK                 DSPI_MSC_DSICR0_TRG_MASK
#define DSPI_DSICR0_TRG_SHIFT                DSPI_MSC_DSICR0_TRG_SHIFT
#define DSPI_DSICR0_TRG_WIDTH                DSPI_MSC_DSICR0_TRG_WIDTH
#define DSPI_DSICR0_TRG(x)                   DSPI_MSC_DSICR0_TRG(x)
#define DSPI_DSICR0_FMSZ5_MASK               DSPI_MSC_DSICR0_FMSZ5_MASK
#define DSPI_DSICR0_FMSZ5_SHIFT              DSPI_MSC_DSICR0_FMSZ5_SHIFT
#define DSPI_DSICR0_FMSZ5_WIDTH              DSPI_MSC_DSICR0_FMSZ5_WIDTH
#define DSPI_DSICR0_FMSZ5(x)                 DSPI_MSC_DSICR0_FMSZ5(x)
#define DSPI_DSICR0_FMSZ4_MASK               DSPI_MSC_DSICR0_FMSZ4_MASK
#define DSPI_DSICR0_FMSZ4_SHIFT              DSPI_MSC_DSICR0_FMSZ4_SHIFT
#define DSPI_DSICR0_FMSZ4_WIDTH              DSPI_MSC_DSICR0_FMSZ4_WIDTH
#define DSPI_DSICR0_FMSZ4(x)                 DSPI_MSC_DSICR0_FMSZ4(x)
#define DSPI_SDR0_SER_DATA_MASK              DSPI_MSC_SDR0_SER_DATA_MASK
#define DSPI_SDR0_SER_DATA_SHIFT             DSPI_MSC_SDR0_SER_DATA_SHIFT
#define DSPI_SDR0_SER_DATA_WIDTH             DSPI_MSC_SDR0_SER_DATA_WIDTH
#define DSPI_SDR0_SER_DATA(x)                DSPI_MSC_SDR0_SER_DATA(x)
#define DSPI_ASDR0_ASER_DATA_MASK            DSPI_MSC_ASDR0_ASER_DATA_MASK
#define DSPI_ASDR0_ASER_DATA_SHIFT           DSPI_MSC_ASDR0_ASER_DATA_SHIFT
#define DSPI_ASDR0_ASER_DATA_WIDTH           DSPI_MSC_ASDR0_ASER_DATA_WIDTH
#define DSPI_ASDR0_ASER_DATA(x)              DSPI_MSC_ASDR0_ASER_DATA(x)
#define DSPI_COMPR0_COMP_DATA_MASK           DSPI_MSC_COMPR0_COMP_DATA_MASK
#define DSPI_COMPR0_COMP_DATA_SHIFT          DSPI_MSC_COMPR0_COMP_DATA_SHIFT
#define DSPI_COMPR0_COMP_DATA_WIDTH          DSPI_MSC_COMPR0_COMP_DATA_WIDTH
#define DSPI_COMPR0_COMP_DATA(x)             DSPI_MSC_COMPR0_COMP_DATA(x)
#define DSPI_DDR0_DESER_DATA_MASK            DSPI_MSC_DDR0_DESER_DATA_MASK
#define DSPI_DDR0_DESER_DATA_SHIFT           DSPI_MSC_DDR0_DESER_DATA_SHIFT
#define DSPI_DDR0_DESER_DATA_WIDTH           DSPI_MSC_DDR0_DESER_DATA_WIDTH
#define DSPI_DDR0_DESER_DATA(x)              DSPI_MSC_DDR0_DESER_DATA(x)
#define DSPI_DSICR1_DPCS1_x_MASK             DSPI_MSC_DSICR1_DPCS1_x_MASK
#define DSPI_DSICR1_DPCS1_x_SHIFT            DSPI_MSC_DSICR1_DPCS1_x_SHIFT
#define DSPI_DSICR1_DPCS1_x_WIDTH            DSPI_MSC_DSICR1_DPCS1_x_WIDTH
#define DSPI_DSICR1_DPCS1_x(x)               DSPI_MSC_DSICR1_DPCS1_x(x)
#define DSPI_DSICR1_DSE0_MASK                DSPI_MSC_DSICR1_DSE0_MASK
#define DSPI_DSICR1_DSE0_SHIFT               DSPI_MSC_DSICR1_DSE0_SHIFT
#define DSPI_DSICR1_DSE0_WIDTH               DSPI_MSC_DSICR1_DSE0_WIDTH
#define DSPI_DSICR1_DSE0(x)                  DSPI_MSC_DSICR1_DSE0(x)
#define DSPI_DSICR1_DSE1_MASK                DSPI_MSC_DSICR1_DSE1_MASK
#define DSPI_DSICR1_DSE1_SHIFT               DSPI_MSC_DSICR1_DSE1_SHIFT
#define DSPI_DSICR1_DSE1_WIDTH               DSPI_MSC_DSICR1_DSE1_WIDTH
#define DSPI_DSICR1_DSE1(x)                  DSPI_MSC_DSICR1_DSE1(x)
#define DSPI_DSICR1_DSI64E_MASK              DSPI_MSC_DSICR1_DSI64E_MASK
#define DSPI_DSICR1_DSI64E_SHIFT             DSPI_MSC_DSICR1_DSI64E_SHIFT
#define DSPI_DSICR1_DSI64E_WIDTH             DSPI_MSC_DSICR1_DSI64E_WIDTH
#define DSPI_DSICR1_DSI64E(x)                DSPI_MSC_DSICR1_DSI64E(x)
#define DSPI_DSICR1_CSE_MASK                 DSPI_MSC_DSICR1_CSE_MASK
#define DSPI_DSICR1_CSE_SHIFT                DSPI_MSC_DSICR1_CSE_SHIFT
#define DSPI_DSICR1_CSE_WIDTH                DSPI_MSC_DSICR1_CSE_WIDTH
#define DSPI_DSICR1_CSE(x)                   DSPI_MSC_DSICR1_CSE(x)
#define DSPI_DSICR1_TSBCNT_MASK              DSPI_MSC_DSICR1_TSBCNT_MASK
#define DSPI_DSICR1_TSBCNT_SHIFT             DSPI_MSC_DSICR1_TSBCNT_SHIFT
#define DSPI_DSICR1_TSBCNT_WIDTH             DSPI_MSC_DSICR1_TSBCNT_WIDTH
#define DSPI_DSICR1_TSBCNT(x)                DSPI_MSC_DSICR1_TSBCNT(x)
#define DSPI_SSR0_SS_MASK                    DSPI_MSC_SSR0_SS_MASK
#define DSPI_SSR0_SS_SHIFT                   DSPI_MSC_SSR0_SS_SHIFT
#define DSPI_SSR0_SS_WIDTH                   DSPI_MSC_SSR0_SS_WIDTH
#define DSPI_SSR0_SS(x)                      DSPI_MSC_SSR0_SS(x)
#define DSPI_DIMR0_MASK_MASK                 DSPI_MSC_DIMR0_MASK_MASK
#define DSPI_DIMR0_MASK_SHIFT                DSPI_MSC_DIMR0_MASK_SHIFT
#define DSPI_DIMR0_MASK_WIDTH                DSPI_MSC_DIMR0_MASK_WIDTH
#define DSPI_DIMR0_MASK(x)                   DSPI_MSC_DIMR0_MASK(x)
#define DSPI_DPIR0_DP_MASK                   DSPI_MSC_DPIR0_DP_MASK
#define DSPI_DPIR0_DP_SHIFT                  DSPI_MSC_DPIR0_DP_SHIFT
#define DSPI_DPIR0_DP_WIDTH                  DSPI_MSC_DPIR0_DP_WIDTH
#define DSPI_DPIR0_DP(x)                     DSPI_MSC_DPIR0_DP(x)
#define DSPI_SDR1_SER_DATA_MASK              DSPI_MSC_SDR1_SER_DATA_MASK
#define DSPI_SDR1_SER_DATA_SHIFT             DSPI_MSC_SDR1_SER_DATA_SHIFT
#define DSPI_SDR1_SER_DATA_WIDTH             DSPI_MSC_SDR1_SER_DATA_WIDTH
#define DSPI_SDR1_SER_DATA(x)                DSPI_MSC_SDR1_SER_DATA(x)
#define DSPI_ASDR1_ASER_DATA_MASK            DSPI_MSC_ASDR1_ASER_DATA_MASK
#define DSPI_ASDR1_ASER_DATA_SHIFT           DSPI_MSC_ASDR1_ASER_DATA_SHIFT
#define DSPI_ASDR1_ASER_DATA_WIDTH           DSPI_MSC_ASDR1_ASER_DATA_WIDTH
#define DSPI_ASDR1_ASER_DATA(x)              DSPI_MSC_ASDR1_ASER_DATA(x)
#define DSPI_COMPR1_COMP_DATA_MASK           DSPI_MSC_COMPR1_COMP_DATA_MASK
#define DSPI_COMPR1_COMP_DATA_SHIFT          DSPI_MSC_COMPR1_COMP_DATA_SHIFT
#define DSPI_COMPR1_COMP_DATA_WIDTH          DSPI_MSC_COMPR1_COMP_DATA_WIDTH
#define DSPI_COMPR1_COMP_DATA(x)             DSPI_MSC_COMPR1_COMP_DATA(x)
#define DSPI_DDR1_DESER_DATA_MASK            DSPI_MSC_DDR1_DESER_DATA_MASK
#define DSPI_DDR1_DESER_DATA_SHIFT           DSPI_MSC_DDR1_DESER_DATA_SHIFT
#define DSPI_DDR1_DESER_DATA_WIDTH           DSPI_MSC_DDR1_DESER_DATA_WIDTH
#define DSPI_DDR1_DESER_DATA(x)              DSPI_MSC_DDR1_DESER_DATA(x)
#define DSPI_SSR1_SS_MASK                    DSPI_MSC_SSR1_SS_MASK
#define DSPI_SSR1_SS_SHIFT                   DSPI_MSC_SSR1_SS_SHIFT
#define DSPI_SSR1_SS_WIDTH                   DSPI_MSC_SSR1_SS_WIDTH
#define DSPI_SSR1_SS(x)                      DSPI_MSC_SSR1_SS(x)
#define DSPI_DIMR1_MASK_MASK                 DSPI_MSC_DIMR1_MASK_MASK
#define DSPI_DIMR1_MASK_SHIFT                DSPI_MSC_DIMR1_MASK_SHIFT
#define DSPI_DIMR1_MASK_WIDTH                DSPI_MSC_DIMR1_MASK_WIDTH
#define DSPI_DIMR1_MASK(x)                   DSPI_MSC_DIMR1_MASK(x)
#define DSPI_DPIR1_DP_MASK                   DSPI_MSC_DPIR1_DP_MASK
#define DSPI_DPIR1_DP_SHIFT                  DSPI_MSC_DPIR1_DP_SHIFT
#define DSPI_DPIR1_DP_WIDTH                  DSPI_MSC_DPIR1_DP_WIDTH
#define DSPI_DPIR1_DP(x)                     DSPI_MSC_DPIR1_DP(x)
#define DSPI_CTARE_DTCP_MASK                 DSPI_MSC_CTARE_DTCP_MASK
#define DSPI_CTARE_DTCP_SHIFT                DSPI_MSC_CTARE_DTCP_SHIFT
#define DSPI_CTARE_DTCP_WIDTH                DSPI_MSC_CTARE_DTCP_WIDTH
#define DSPI_CTARE_DTCP(x)                   DSPI_MSC_CTARE_DTCP(x)
#define DSPI_CTARE_FMSZE_MASK                DSPI_MSC_CTARE_FMSZE_MASK
#define DSPI_CTARE_FMSZE_SHIFT               DSPI_MSC_CTARE_FMSZE_SHIFT
#define DSPI_CTARE_FMSZE_WIDTH               DSPI_MSC_CTARE_FMSZE_WIDTH
#define DSPI_CTARE_FMSZE(x)                  DSPI_MSC_CTARE_FMSZE(x)
#define DSPI_SREX_CMDNXTPTR_MASK             DSPI_MSC_SREX_CMDNXTPTR_MASK
#define DSPI_SREX_CMDNXTPTR_SHIFT            DSPI_MSC_SREX_CMDNXTPTR_SHIFT
#define DSPI_SREX_CMDNXTPTR_WIDTH            DSPI_MSC_SREX_CMDNXTPTR_WIDTH
#define DSPI_SREX_CMDNXTPTR(x)               DSPI_MSC_SREX_CMDNXTPTR(x)
#define DSPI_SREX_CMDCTR_MASK                DSPI_MSC_SREX_CMDCTR_MASK
#define DSPI_SREX_CMDCTR_SHIFT               DSPI_MSC_SREX_CMDCTR_SHIFT
#define DSPI_SREX_CMDCTR_WIDTH               DSPI_MSC_SREX_CMDCTR_WIDTH
#define DSPI_SREX_CMDCTR(x)                  DSPI_MSC_SREX_CMDCTR(x)
#define DSPI_SREX_RXCTR4_MASK                DSPI_MSC_SREX_RXCTR4_MASK
#define DSPI_SREX_RXCTR4_SHIFT               DSPI_MSC_SREX_RXCTR4_SHIFT
#define DSPI_SREX_RXCTR4_WIDTH               DSPI_MSC_SREX_RXCTR4_WIDTH
#define DSPI_SREX_RXCTR4(x)                  DSPI_MSC_SREX_RXCTR4(x)
#define DSPI_SREX_TXCTR4_MASK                DSPI_MSC_SREX_TXCTR4_MASK
#define DSPI_SREX_TXCTR4_SHIFT               DSPI_MSC_SREX_TXCTR4_SHIFT
#define DSPI_SREX_TXCTR4_WIDTH               DSPI_MSC_SREX_TXCTR4_WIDTH
#define DSPI_SREX_TXCTR4(x)                  DSPI_MSC_SREX_TXCTR4(x)
#define DSPI_TSL_TS0_LEN_MASK                DSPI_MSC_TSL_TS0_LEN_MASK
#define DSPI_TSL_TS0_LEN_SHIFT               DSPI_MSC_TSL_TS0_LEN_SHIFT
#define DSPI_TSL_TS0_LEN_WIDTH               DSPI_MSC_TSL_TS0_LEN_WIDTH
#define DSPI_TSL_TS0_LEN(x)                  DSPI_MSC_TSL_TS0_LEN(x)
#define DSPI_TSL_TS1_LEN_MASK                DSPI_MSC_TSL_TS1_LEN_MASK
#define DSPI_TSL_TS1_LEN_SHIFT               DSPI_MSC_TSL_TS1_LEN_SHIFT
#define DSPI_TSL_TS1_LEN_WIDTH               DSPI_MSC_TSL_TS1_LEN_WIDTH
#define DSPI_TSL_TS1_LEN(x)                  DSPI_MSC_TSL_TS1_LEN(x)
#define DSPI_TSL_TS2_LEN_MASK                DSPI_MSC_TSL_TS2_LEN_MASK
#define DSPI_TSL_TS2_LEN_SHIFT               DSPI_MSC_TSL_TS2_LEN_SHIFT
#define DSPI_TSL_TS2_LEN_WIDTH               DSPI_MSC_TSL_TS2_LEN_WIDTH
#define DSPI_TSL_TS2_LEN(x)                  DSPI_MSC_TSL_TS2_LEN(x)
#define DSPI_TSL_TS3_LEN_MASK                DSPI_MSC_TSL_TS3_LEN_MASK
#define DSPI_TSL_TS3_LEN_SHIFT               DSPI_MSC_TSL_TS3_LEN_SHIFT
#define DSPI_TSL_TS3_LEN_WIDTH               DSPI_MSC_TSL_TS3_LEN_WIDTH
#define DSPI_TSL_TS3_LEN(x)                  DSPI_MSC_TSL_TS3_LEN(x)
#define DSPI_TS_CONF_TS0_MASK                DSPI_MSC_TS_CONF_TS0_MASK
#define DSPI_TS_CONF_TS0_SHIFT               DSPI_MSC_TS_CONF_TS0_SHIFT
#define DSPI_TS_CONF_TS0_WIDTH               DSPI_MSC_TS_CONF_TS0_WIDTH
#define DSPI_TS_CONF_TS0(x)                  DSPI_MSC_TS_CONF_TS0(x)
#define DSPI_TS_CONF_TS1_MASK                DSPI_MSC_TS_CONF_TS1_MASK
#define DSPI_TS_CONF_TS1_SHIFT               DSPI_MSC_TS_CONF_TS1_SHIFT
#define DSPI_TS_CONF_TS1_WIDTH               DSPI_MSC_TS_CONF_TS1_WIDTH
#define DSPI_TS_CONF_TS1(x)                  DSPI_MSC_TS_CONF_TS1(x)
#define DSPI_TS_CONF_TS2_MASK                DSPI_MSC_TS_CONF_TS2_MASK
#define DSPI_TS_CONF_TS2_SHIFT               DSPI_MSC_TS_CONF_TS2_SHIFT
#define DSPI_TS_CONF_TS2_WIDTH               DSPI_MSC_TS_CONF_TS2_WIDTH
#define DSPI_TS_CONF_TS2(x)                  DSPI_MSC_TS_CONF_TS2(x)
#define DSPI_TS_CONF_TS3_MASK                DSPI_MSC_TS_CONF_TS3_MASK
#define DSPI_TS_CONF_TS3_SHIFT               DSPI_MSC_TS_CONF_TS3_SHIFT
#define DSPI_TS_CONF_TS3_WIDTH               DSPI_MSC_TS_CONF_TS3_WIDTH
#define DSPI_TS_CONF_TS3(x)                  DSPI_MSC_TS_CONF_TS3(x)
/*! @} */

/*!
 * @}
 */ /* end of group DSPI_Register_Masks */

/*!
 * @}
 */ /* end of group DSPI_Peripheral_Access_Layer */
/*==================================================================================================
*                                              ENUMS
==================================================================================================*/

/*==================================================================================================
*                                  STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/

/*==================================================================================================
*                                  GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/

/*==================================================================================================
*                                       FUNCTION PROTOTYPES
==================================================================================================*/

#ifdef __cplusplus
}
#endif

/** @} */

#endif /*S32K3_DSPI_MSC_WRAPPER*/
